//*رد بوت ساسكي تبع ايتاتشي
// معلش ي ايتاتشي كسلت اعمل واحده 😀
// اعمل واحده بس احط رد تل

let handler = m => m; 
 handler.all = async function (m) { 

   let chat = global.db.data.chats[m.chat]; 
   let responses; 
   if (/^هلا$/i.test(m.text)) { 
     responses = [ 
 '*هلا بيك يعمري 😩❤‍🔥*'  
     ]; 
} else if (/^السلام عليكم|سلام عليكم ورحمه الله وبركاته|سلام عليكم|السلام عليكم ورحمه الله وبركاته$/i.test(m.text)) { 
     responses = [ 
       '*♥🐥وعليكم السلام*',  
     ]; 
   }else if (/^بوت$/i.test(m.text)) { 
     responses = [ 
'*بوت في عينك اسمي مايكي*'
     ]; 
 }else if (/^كسمك$/i.test(m.text)) {
     responses = [ 
'*ابوي ركب امك وحط زبو في كسمك*'
     ]; 
   }else if (/^مايكي انت مرتبط$/i.test(m.text)) { 
     responses = [ 
'*منين يابني*', 
       '*نفسي في بوته*', 
       '*الحاله مقشفه يصحبي*', 
   ]; 
   }else if (/^مايكي تحبني$/i.test(m.text)) { 
     responses = [ 
'*اموت فيك 🌚💔*',
'*اكرهك🙂💔*',
'*احبك نص حب 🙃💔*',
       '*بحب النسوان بس*', 
       '*لا مش بحب الرجاله*', 
]; 
   }else if (/^مايكي تكرهني$/i.test(m.text)) { 
     responses = [ 
'*ماعاش من يكرهكك حبي 🙁*',
'*لا بس لا تتعب نفسك لحبك🫥*',
'*ااي اكرهك🙄*',   ]; 
     
     }else if (/^هاي|هالو$/i.test(m.text)) { 
     responses = [ 
       '*هالو🌚♥*',  

     ]; 
}else if (/^بحبك/i.test(m.text)) { 
     responses = [ 
       '*بحبك اكتر🌚❤*',  

     ]; 
   }else if (/^مايكي انت من وين$/i.test(m.text)) { 
     responses = [ 
'❤🇪🇬مصر'
     ]; 
   } else if (/^احبك$/i.test(m.text)) { 
     responses = [ 
'*مـي تو 🙂🫀*'
     ]; 
     }else if (/^عامل ايه|عامل اي|عامل اية$/i.test(m.text)) { 
     responses = [ 
       'الحمدالله',  

     ];
     }else if (/^مايكيي$/i.test(m.text)) { 
     responses = [ 
       '*افضل مطور في التاريخ*',  
       '*احبه مطوري*', 
       '*مطور سئ ما سوالي بوته*', 
       '*شوية ويكون هو والكرسي واحد*', 
       '*ياخي خله يعطينا وصفة للشعر*', 
       '*كيوت نمنم ابو شعر اصفر*', 
       '*بيحب النسوان اوي*', 
       '*اعظم نائب علي مر التاريخ🫡*', 
       '*فشخ ايتادوري في ببجي ههههه*', 

     ];
     }else if (/^انيا$/i.test(m.text)) { 
     responses = [ 
       '*عمتكم يا اهل الجروب🫡🖤*',  
       '*ياحظ حبيبها فيها🫣*', 
       '*كرواسون الجروب*', 
       '*اليوم كله تاكل شوي وتكون مدام نفيخه*', 
       '*خلوها تشوفلي صاحبتها*', 
       '*قصيرة الساقين*', 
       '*هي اطول من فايوليت😂💔*', 
       '*عطوني افكار اكتبها عنها*', 
       '*اعطوها اندومي تحبكم اكثر من اخوانها*', 
       '*عمتكم يا اهل الجروب🫡🖤*', 
       '*عمتكم يا اهل الجروب🫡🖤*', 
              '*عمتكم يا اهل الجروب🫡🖤*', 
       
     ];
     }else if (/^شينرا$/i.test(m.text)) { 
     responses = [ 
       '*اعظم مؤسس علي مر العصور*',  
       '*هادئ اكثر من ايانوكوجي*', 
       '*يفشخ اي بني ادم ببجي*', 
       '*مرتبط وما حد يدري انا متاكد*', 
       '*يحبي له*', 
       '*شوي وياخذوه في فصل النخبة*', 

     ];
     }else if (/^دوكجا$/i.test(m.text)) { 
     responses = [ 
       '*اجدع منوفي في مصر*',  
       '*اول منوفي مش بخيل*', 
       '*بيحب الفيوميه*', 

     ]; 
     }else if (/^قران$/i.test(m.text)) { 
     responses = [ 
'*وَمِنْهُم مَّن يَقُولُ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَة وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّار*', 
     
     ];
     }else if (/^صباح|صباح$/ .test(m.text)) { 
     responses = [ 
       '*صباح الورد♥*',  
     ];
       }else if (/^اية$/i.test(m.text)) { 
     responses = [ 
       '*لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا ۚ لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ ۗ رَبَّنَا لَا تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ ۖ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا ۚ أَنتَ مَوْلَانَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ*',  
     ];
            }else if (/^مايكي$/i.test(m.text)) { 
     responses = [ 
       '*قلب مايكي😔🖤*',  
     ];
            }else if (/^ايه$/i.test(m.text)) { 
     responses = [ 
       '*فَاستَجَبنا لَهُ وَنَجَّيناهُ مِنَ الغَمِّ وَكَذلِكَ نُنجِي المُؤمِنين *', 
       '*رِجَالٌ لّا تُلْهِيهِمْ تِجَارَةٌ وَلا بَيْعٌ عَن ذِكْرِ اللَّهِ وَإِقَامِ الصَّلاةِ وَإِيتَاء الزَّكَاةِ يَخَافُونَ يَوْمًا تَتَقَلَّبُ فِيهِ الْقُلُوبُ وَالأَبْصَارُ*', 
       '*بُشْرَاكُمُ الْيَوْمَ*', 
             '*لِيَجْزِيَهُمُ اللَّهُ أَحْسَنَ مَا عَمِلُوا وَيَزِيدَهُم مِّن فَضْلِهِ وَاللَّهُ يَرْزُقُ مَن يَشَاء بِغَيْرِ حِسَابٍ*', 
       '*فِي بُيُوتٍ أَذِنَ اللَّهُ أَن تُرْفَعَ وَيُذْكَرَ فِيهَا اسْمُهُ يُسَبِّحُ لَهُ فِيهَا بِالْغُدُوِّ وَالآصَالِ*', 
      '*وَآتَاكُم مِّن كُلِّ مَا سَأَلْتُمُوهُ*', 
       '*أنَّ اللَّهَ يُبَشِّرُكَ*', 
       '*وَجَاءُوا عَلَىٰ قَمِيصِهِ بِدَمٍ كَذِبٍ ۚ قَالَ بَلْ سَوَّلَتْ لَكُمْ أَنفُسُكُمْ أَمْرًا ۖ فَصَبْرٌ جَمِيلٌ ۖ وَاللَّهُ الْمُسْتَعَانُ عَلَىٰ مَا تَصِفُونَ*', 
       '*وَاصْبِرْ وَمَا صَبْرُكَ إِلَّا بِاللَّهِ ۚ وَلَا تَحْزَنْ عَلَيْهِمْ وَلَا تَكُ فِي ضَيْقٍ مِّمَّا يَمْكُرُونَ*', 
       '*قُلْ يَا عِبَادِيَ الَّذِينَ أَسْرَفُوا عَلَىٰ أَنفُسِهِمْ لَا تَقْنَطُوا مِن رَّحْمَةِ اللَّهِ ۚ إِنَّ اللَّهَ يَغْفِرُ الذُّنُوبَ جَمِيعًا ۚ إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ*', 
       '*وَالسَّابِقُونَ الْأَوَّلُونَ مِنَ الْمُهَاجِرِينَ وَالْأَنصَارِ وَالَّذِينَ اتَّبَعُوهُم بِإِحْسَانٍ رَّضِيَ اللَّهُ عَنْهُمْ وَرَضُوا عَنْهُ وَأَعَدَّ لَهُمْ جَنَّاتٍ تَجْرِي تَحْتَهَا الْأَنْهَارُ خَالِدِينَ فِيهَا أَبَدًا ۚ ذَٰلِكَ الْفَوْزُ الْعَظِيمُ*', 
      '*وَمِمَّنْ حَوْلَكُم مِّنَ الْأَعْرَابِ مُنَافِقُونَ ۖ وَمِنْ أَهْلِ الْمَدِينَةِ ۖ مَرَدُوا عَلَى النِّفَاقِ لَا تَعْلَمُهُمْ ۖ نَحْنُ نَعْلَمُهُمْ ۚ سَنُعَذِّبُهُم مَّرَّتَيْنِ ثُمَّ يُرَدُّونَ إِلَىٰ عَذَابٍ عَظِيمٍ*', 
       '*وَآخَرُونَ اعْتَرَفُوا بِذُنُوبِهِمْ خَلَطُوا عَمَلًا صَالِحًا وَآخَرَ سَيِّئًا عَسَى اللَّهُ أَن يَتُوبَ عَلَيْهِمْ ۚ إِنَّ اللَّهَ غَفُورٌ رَّحِيمٌ*', 
       '*أَلَمْ يَعْلَمُوا أَنَّ اللَّهَ هُوَ يَقْبَلُ التَّوْبَةَ عَنْ عِبَادِهِ وَيَأْخُذُ الصَّدَقَاتِ وَأَنَّ اللَّهَ هُوَ التَّوَّابُ الرَّحِيمُ*', 
       
     ];
   }
   if (responses) { 
     let randomIndex = Math.floor(Math.random() * responses.length); 
     conn.reply(m.chat, responses[randomIndex], m); 
   } 
   return !0 
 }; 

 export default handler;